politicshun/esp32-s3-vehicle-display/sdkconfig.defaults
# sdkconfig.defaults
# idf.py set-target 또는 sdkconfig가 없을 때 자동 적용되는 기본값.
# 여기 있는 항목은 전부 이 프로젝트 대화 기록/실제 sdkconfig(idf.py save-defconfig 기준)에서
# 확인된 값만 넣었습니다.

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Bluetooth / NimBLE (BLE GATT 서버 구현 시 확정) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n

# --- Flash size (ESP32-S3-WROOM-1-N8R8, 8MB Flash) ---
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# --- PSRAM (ESP32-S3-WROOM-1-N8R8의 R8 = Octal 임베디드 PSRAM 8MB) ---
# 실기기 부팅 로그(esptool)에서 "Embedded PSRAM 8MB (AP_3v3)"로 실측 확인(2026-07-30).
# 옵션명은 IDF v6.0.2 설치 경로의 esp_psram/esp32s3/Kconfig.spiram 및
# examples/peripherals/lcd/rgb_panel/sdkconfig.defaults.esp32s3(동일 RGB+PSRAM 프레임버퍼 구성)로 대조함.
# 이게 없으면 esp_lcd_new_rgb_panel()의 fb_in_psram=true가 "no mem for frame buffer"로 실패함.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# --- Legacy driver / deprecation 경고 억제 (idf.py save-defconfig로 확인, 2026-07-29) ---
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
CONFIG_I2C_SUPPRESS_DEPRECATE_WARN=y

# --- LVGL 폰트: main/ui/ui_style.c가 lv_font_montserrat_24/48을 참조함.
#     idf.py save-defconfig가 이 두 항목은 자동으로 못 뽑아내서(defaults 파일에 없던 심볼은
#     현재 sdkconfig 값을 기본값으로 취급해버려 diff가 0이 되는 kconfgen 함정) 수동으로 추가함
#     (2026-07-29). ---
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# --- LVGL 리프레시/입력 폴링 주기: lvgl_ui_task의 20ms 루프 주기와 맞춤(2026-07-30).
#     기본값 30ms에서는 20ms마다 도는 태스크 루프 중 일부가 lv_timer_handler() 안에서
#     "아직 주기 안 지남"으로 버려져 드래그 반응이 뻑뻑하게 느껴짐. ---
CONFIG_LV_DISP_DEF_REFR_PERIOD=20
CONFIG_LV_INDEV_DEF_READ_PERIOD=20
